ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_wadi_oper_sss_regs.xml
<module id="WADI_OPER_SSS_REGS" HW_revision="" description="WADI OPER SSS Registers">
	<register id="BASETIMERLOW" width="32" page="0" offset="0x0" instances="1" instaddr="4" internal="0" description="Read only value for lower word of the base timer. ">
		<bitfield id="LOWWORD" description="Timer value of 31:0 of the base timer. " begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="BASETIMERHIGH" width="32" page="0" offset="0x4" instances="1" instaddr="4" internal="0" description="Upper word of the base timer and trigger to start the timer.">
		<bitfield id="HIGHWORD" description="Upper word of the base timer" begin="27" end="0" width="28" rwaccess="R"/>
		<bitfield id="ENBASETIMER" description="Start base timer trigger" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="INTSTS" width="32" page="0" offset="0x8" instances="1" instaddr="4" internal="0" description="Gives the block wise aggregated raw error status that shall trigger the interrupt. ">
		<bitfield id="BLK1INT" description="Interrupt status by ORing all WADI block errors" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="BLK2INT" description="Interrupt status by ORing all WADI block errors" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="BLK3INT" description="Interrupt status by ORing all WADI block errors" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="BLK4INT" description="Interrupt status by ORing all WADI block errors" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="SIGBLKSINT" description="ORed int status of measurement error for all WADI blocks" begin="30" end="30" width="1" rwaccess="R"/>
		<bitfield id="SIGTOSIG_BLKSINT" description="ORed int status of mismatch error for all WADI blocks" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="INTSTSMASK" width="32" page="0" offset="0xc" instances="1" instaddr="4" internal="0" description="Provides mask for application to suppress or allow a particular block related errors to cause interrupt or not">
		<bitfield id="BLKSMASK" description="Line wise mask to propagate interrupt or not" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="SIGBLKSMASK" description="Line wise mask to propagate interrupt or not" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="SIGTOSIG_BLKSMASK" description="Line wise mask to propagate interrupt or not" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="BLKSMASKSTS" width="32" page="0" offset="0x10" instances="1" instaddr="4" internal="0" description="This is AND combination of active high indication of block-wise status asserting an interrupt. ">
		<bitfield id="BLKSMASK" description="This is AND of INTSTS and INTSTSMASK" begin="15" end="0" width="16" rwaccess="R"/>
		<bitfield id="SIGBLKS" description="This is AND of INTSTS and INTSTSMASK" begin="30" end="30" width="1" rwaccess="R"/>
		<bitfield id="SIGTOSIGBLKS" description="This is AND of INTSTS and INTSTSMASK" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="INTSTSCLR" width="32" page="0" offset="0x14" instances="1" instaddr="4" internal="0" description="Provides way for application to clear the interrupt status.">
		<bitfield id="BLK1INT" description="Clears the status of the INTSTS of Block 1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="BLK2INT" description="Clears the status of the INTSTS of Block 2" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="BLK3INT" description="Clears the status of the INTSTS of Block 3" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="BLK4INT" description="Clears the status of the INTSTS of Block 4" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SIGBLKSINT" description="Clears the status of all block's INTSTS[SIGBLKSINT]" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="SIGTOSIG_BLKSINT" description="Clears the status of all block's INTSTS[SIGTOSIG_BLKSINT]" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="INTSTSFRC" width="32" page="0" offset="0x18" instances="1" instaddr="4" internal="0" description="Allows emulation of the RIS to raise interrupt in software">
		<bitfield id="BLK1INT" description="Allows software force of WADI Block interrupt" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="BLK2INT" description="Allows software force of WADI Block interrupt" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="BLK3INT" description="Allows software force of WADI Block interrupt" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="BLK4INT" description="Allows software force of WADI Block interrupt" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SIGBLKSINT" description="Allows software force of WADI Block interrupt" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="SIGTOSIG_BLKSINT" description="Allows software force of WADI Block interrupt" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="SIGSYNCFILTCFG" width="32" page="0" offset="0x1c" instances="1" instaddr="4" internal="0" description="Each input SIG to be connected through synchroniser or not">
		<bitfield id="BLKS_SIGS_SYNCFILT" description="Selects SIG is synchronised and filtered or not" begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
	<register id="TRIGSYNCFILTCFG" width="32" page="0" offset="0x20" instances="1" instaddr="4" internal="0" description="Each trigger to be connected through synchroniser or not">
		<bitfield id="BLKS_TRIG_SYNCFILT" description="Selects Trigger input is synchronised and filtered or not" begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
	<register id="REVISION" width="32" page="0" offset="0x3c" instances="1" instaddr="4" internal="0" description="IP Revision">
		<bitfield id="MINOR" description="Minor Revision Number" begin="5" end="0" width="6" rwaccess="R"/>
		<bitfield id="CUSTOM" description="Custom Module Number" begin="7" end="6" width="2" rwaccess="R"/>
		<bitfield id="MAJOR" description="Major Revision Number" begin="10" end="8" width="3" rwaccess="R"/>
		<bitfield id="RTL" description="Design Release Number" begin="15" end="11" width="5" rwaccess="R"/>
		<bitfield id="FUNC" description="Functional Release Number" begin="27" end="16" width="12" rwaccess="R"/>
		<bitfield id="SCHEME" description="Defines Scheme for Module" begin="31" end="30" width="2" rwaccess="R"/>
	</register>
	<register id="DMATRIGSTS" width="32" page="0" offset="0x40" instances="1" instaddr="4" internal="0" description="Status of the DMA triggers active">
		<bitfield id="BLK1_DMAEVT" description="Indicates the WADI Block event for DMA trigger" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="BLK2_DMAEVT" description="Indicates the WADI Block event for DMA trigger" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="BLK3_DMAEVT" description="Indicates the WADI Block event for DMA trigger" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="BLK4_DMAEVT" description="Indicates the WADI Block event for DMA trigger" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SSS_EVT1" description="Indicates the SSS Event event for DMA trigger" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="SSS_EVT2" description="Indicates the SSS Event for DMA trigger" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="SSS_EVT3" description="Indicates the SSS Event for DMA trigger" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="SSS_EVT4" description="Indicates the SSS Event for DMA trigger" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="SSS_EVT5" description="Indicates the SSS Event for DMA trigger" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="SSS_EVT6" description="Indicates the SSS Event for DMA trigger" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="SSS_EVT7" description="Indicates the SSS Event for DMA trigger" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="SSS_EVT8" description="Indicates the SSS Event for DMA trigger" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="SSS_OUTEVT1" description="Indicates the SSS output event for DMA trigger" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="SSS_OUTEVT2" description="Indicates the SSS output event for DMA trigger" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="SSS_OUTEVT3" description="Indicates the SSS output event for DMA trigger" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="SSS_OUTEVT4" description="Indicates the SSS output event for DMA trigger" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="SSS_OUTEVT5" description="Indicates the SSS output event for DMA trigger" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="SSS_OUTEVT6" description="Indicates the SSS output event for DMA trigger" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="SSS_OUTEVT7" description="Indicates the SSS output event for DMA trigger" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="SSS_OUTEVT8" description="Indicates the SSS output event for DMA trigger" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
