ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_wadi_oper_sss_regs.xml
	<register id="DMATRIGEN" width="32" page="0" offset="0x44" instances="1" instaddr="4" internal="0" description="Mask to enable individual trigger cause">
		<bitfield id="BLKSDMAEVT" description="WADI Block event enables for DMA request trigger" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="SSS_EVT1_4DMA" description="SSS Event word Set-1 enables for DMA request Trigger" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="SSS_EVT5_8DMA" description="SSS Event word Set-2 enables for DMA request Trigger" begin="23" end="20" width="4" rwaccess="RW"/>
		<bitfield id="SSS_OUTEVT1_4DMA" description="SSS output event 1 to 4 enables for DMA request Trigger" begin="27" end="24" width="4" rwaccess="RW"/>
		<bitfield id="SSS_OUTEVT5_8DMA" description="SSS output event 5 to 8 enables for DMA request Trigger" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="DMASTSUPDATE" width="32" page="0" offset="0x48" instances="1" instaddr="4" internal="0" description="Indicates the register set updated post DMA write">
		<bitfield id="WRSTSBLK1" description="Status of DMA update for register set of WADI Block" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="WRSTSBLK2" description="Status of DMA update for register set of WADI Block" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="WRSTSBLK3" description="Status of DMA update for register set of WADI Block" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="WRSTSBLK4" description="Status of DMA update for register set of WADI Block" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="WRSTSEVT1" description="DMA MMR write status of  SSS Event word" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="WRSTSEVT2" description="DMA MMR write status of  SSS Event word" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="WRSTSEVT3" description="DMA MMR write status of  SSS Event word" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="WRSTSEVT4" description="DMA MMR write status of  SSS Event word" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="WRSTSEVT5" description="DMA MMR write status of  SSS Event word" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="WRSTSEVT6" description="DMA MMR write status of  SSS Event word" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="WRSTSEVT7" description="DMA MMR write status of  SSS Event word" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="WRSTSEVT8" description="DMA MMR write status of  SSS Event word" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="WRSTSOUT1" description="DMA MMR write status of  SSS OUTEVT1" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="WRSTSOUT2" description="DMA MMR write status of  SSS OUTEVT2" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="WRSTSOUT3" description="DMA MMR write status of  SSS OUTEVT3" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="WRSTSOUT4" description="DMA MMR write status of  SSS OUTEVT4" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="WRSTSOUT5" description="DMA MMR write status of  SSS OUTEVT5" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="WRSTSOUT6" description="DMA MMR write status of  SSS OUTEVT6" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="WRSTSOUT7" description="DMA MMR write status of  SSS OUTEVT7" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="WRSTSOUT8" description="DMA MMR write status of  SSS OUTEVT8" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="DMAFILTWRCFG" width="32" page="0" offset="0x4c" instances="1" instaddr="4" internal="0" description="DMA writes Filter enable for each of WADI and SSS blocks">
		<bitfield id="BLKSWREN" description="Enable for filtered DMA write for WADI Block" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="EVT1_4WREN" description="Enable for filtered DMA write for SSS Event 1 to 4" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="EVT5_8WREN" description="Enable for filtered DMA write for SSS Event 5 to 8" begin="23" end="20" width="4" rwaccess="RW"/>
		<bitfield id="OUTEVT1_4WREN" description="Enable for filtered DMA write for SSS output Events 1-4" begin="27" end="24" width="4" rwaccess="RW"/>
		<bitfield id="OUTEVT5_8WREN" description="Enable for filtered DMA write for SSS output Events 5-8" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="CFGREGLOCK" width="32" page="0" offset="0xa4" instances="1" instaddr="4" internal="0" description="Configuration Register Lock">
		<bitfield id="LOCK" description="Register Lock" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="CFGREGCOMMIT" width="32" page="0" offset="0xa8" instances="1" instaddr="4" internal="0" description="Configuration Register Commit">
		<bitfield id="COMMIT" description="CONFIG_REG_LOCK Permanent Commit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="OPERREGLOCK" width="32" page="0" offset="0xac" instances="1" instaddr="4" internal="0" description="Operating Register Lock">
		<bitfield id="LOCK" description="Register Lock" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="OPERREGCOMMIT" width="32" page="0" offset="0xb0" instances="1" instaddr="4" internal="0" description="Operating Register Commit">
		<bitfield id="COMMIT" description="OPER_REG_LOCK Permanent Commit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="SSS_EVTTRIG" width="32" page="0" offset="0xb8" instances="1" instaddr="4" internal="0" description="Event trigger word output by WADI instance for SSS">
		<bitfield id="EVTTRIG" description="SSS start if event trigger matches one of defined EVT1-8 " begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
	<register id="SSS_OUTEVTSTS" width="32" page="0" offset="0xbc" instances="1" instaddr="4" internal="0" description="Status of the active event">
		<bitfield id="OUTEVT1_4" description="Active seq word status for first set" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="OUTEVT5_8" description="Active seq word status for Second set" begin="7" end="4" width="4" rwaccess="RW"/>
	</register>
	<register id="SSS_BLK1_2OUTSEL" width="32" page="0" offset="0xc0" instances="1" instaddr="4" internal="0" description="Mux select word for outputs 0-3">
		<bitfield id="BLK1SIG1" description="Maps the  OUTEVTn associated with BLK0:SIG1" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="BLK1SIG2" description="Maps the OUTEVTn associated with BLK0:SIG2" begin="15" end="8" width="8" rwaccess="RW"/>
		<bitfield id="BLK2SIG1" description="Maps the OUTEVTn associated with BLK1:SIG1" begin="23" end="16" width="8" rwaccess="RW"/>
		<bitfield id="BLK2SIG2" description="Maps the OUTEVTn associated with BLK1:SIG2" begin="31" end="24" width="8" rwaccess="RW"/>
	</register>
