ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_wadi_oper_sss_regs.xml
	<register id="SSS_BLK3_4OUTSEL" width="32" page="0" offset="0xc4" instances="1" instaddr="4" internal="0" description="Mux select word for outputs 4-7">
		<bitfield id="BLK3SIG1" description="Maps the  OUTEVTn associated with BLK2:SIG1" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="BLK3SIG2" description="Maps the OUTEVTn associated with BLK2:SIG2" begin="15" end="8" width="8" rwaccess="RW"/>
		<bitfield id="BLK4SIG1" description="Maps the OUTEVTn associated with BLK3:SIG1" begin="23" end="16" width="8" rwaccess="RW"/>
		<bitfield id="BLK4SIG2" description="Maps the OUTEVTn associated with BLK3:SIG2" begin="31" end="24" width="8" rwaccess="RW"/>
	</register>
	<register id="SSS_OUTEVT1LINKCFG" width="32" page="0" offset="0xe0" instances="1" instaddr="4" internal="0" description="Output event1 Link configuration">
		<bitfield id="OUTEVT1LINK" description="Links output events (OUTEVTs) as per one hot encoding" begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
	<register id="SSS_OUTEVT2LINKCFG" width="32" page="0" offset="0xe4" instances="1" instaddr="4" internal="0" description="Output event2 link configuration">
		<bitfield id="OUTEVT2LINK" description="Links output events (OUTEVTs) as per one hot encoding" begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
	<register id="SSS_OUTEVT3LINKCFG" width="32" page="0" offset="0xe8" instances="1" instaddr="4" internal="0" description="Output event3 link configuration">
		<bitfield id="OUTEVT3LINK" description="Links output events (OUTEVTs) as per one hot encoding" begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
	<register id="SSS_OUTEVT4LINKCFG" width="32" page="0" offset="0xec" instances="1" instaddr="4" internal="0" description="Output event4 link configuration">
		<bitfield id="OUTEVT4LINK" description="Links output events (OUTEVTs) as per one hot encoding" begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
	<register id="SSS_OUTEVT5LINKCFG" width="32" page="0" offset="0xf0" instances="1" instaddr="4" internal="0" description="Output event5 link configuration">
		<bitfield id="OUTEVT5LINK" description="Links output events (OUTEVTs) as per one hot encoding" begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
	<register id="SSS_OUTEVT6LINKCFG" width="32" page="0" offset="0xf4" instances="1" instaddr="4" internal="0" description="Output event6 link configuration">
		<bitfield id="OUTEVT6LINK" description="Links output events (OUTEVTs) as per one hot encoding" begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
	<register id="SSS_OUTEVT7LINKCFG" width="32" page="0" offset="0xf8" instances="1" instaddr="4" internal="0" description="Output event7 link configuration">
		<bitfield id="OUTEVT7LINK" description="Links output events (OUTEVTs) as per one hot encoding" begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
	<register id="SSS_OUTEVT8LINKCFG" width="32" page="0" offset="0xfc" instances="1" instaddr="4" internal="0" description="Output event8 link configuration">
		<bitfield id="OUT8LINK" description="Links output events (OUTEVTs) as per one hot encoding" begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
	<register id="SSS_EVT1CFG" width="32" page="0" offset="0x100" instances="1" instaddr="4" internal="0" description="Event1 that compares to trigger word SSS_EVTTRIG">
		<bitfield id="EVT1" description="First event compare configuration" begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
	<register id="SSS_EVT2CFG" width="32" page="0" offset="0x104" instances="1" instaddr="4" internal="0" description="Event2 that compares to trigger word SSS_EVTTRIG">
		<bitfield id="EVT2" description="Second word compare value configuration" begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
	<register id="SSS_EVT3CFG" width="32" page="0" offset="0x108" instances="1" instaddr="4" internal="0" description="Event3 that compares to trigger word SSS_EVTTRIG">
		<bitfield id="EVT3" description="Third word compare value configuration" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="EVT3_BLK5_TO_16" description="Third word compare value configuration" begin="31" end="8" width="24" rwaccess="RW"/>
	</register>
	<register id="SSS_EVT4CFG" width="32" page="0" offset="0x10c" instances="1" instaddr="4" internal="0" description="Event4 that compares to trigger word SSS_EVTTRIG">
		<bitfield id="EVT4" description="Fourth word compare value configuration" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="EVT4_BLK5_TO_16" description="Fourth word compare value configuration" begin="31" end="8" width="24" rwaccess="RW"/>
	</register>
	<register id="SSS_TRIGEVT1_4CFG" width="32" page="0" offset="0x110" instances="1" instaddr="4" internal="0" description="Configuration for using trigger word in specific manner">
		<bitfield id="TRIG_EVT1CFG" description="Selects action associated with event 1" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="TRIG_EVT2CFG" description="Selects action associated with event 2" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="TRIG_EVT3CFG" description="Selects action associated with event 3" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="TRIG_EVT4CFG" description="Selects action associated with event 4" begin="27" end="24" width="4" rwaccess="RW"/>
	</register>
	<register id="SSS_BLKSOUTEVT1CFG" width="32" page="0" offset="0x180" instances="1" instaddr="4" internal="0" description="Output event1 to be applied for output ">
		<bitfield id="OUTEVT1" description="Output configuration on event 1" begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
	<register id="SSS_BLKSOUTEVT2CFG" width="32" page="0" offset="0x184" instances="1" instaddr="4" internal="0" description="Output event2 to be applied for output ">
		<bitfield id="OUTEVT2" description="Output configuration on event 2" begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
	<register id="SSS_BLKSOUTEVT3CFG" width="32" page="0" offset="0x188" instances="1" instaddr="4" internal="0" description="Output event3 to be applied for output ">
		<bitfield id="OUTEVT3" description="Output configuration on event 3" begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
