ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_wadi_oper_sss_regs.xml
	<register id="SSS_BLKSOUTEVT4CFG" width="32" page="0" offset="0x18c" instances="1" instaddr="4" internal="0" description="Output event4 to be applied for output ">
		<bitfield id="OUTEVT4" description="Output configuration on event 4" begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
	<register id="SSS_OUTEVT1TRIGCFG" width="32" page="0" offset="0x190" instances="1" instaddr="4" internal="0" description="Output event1 configuration for triggers, link">
		<bitfield id="EVT1TRIG" description="Sets OUTEVT1 based on Event 1 Trigger" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="EVT2TRIG" description="Sets OUTEVT1 based on Event 2 Trigger" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="EVT3TRIG" description="Sets OUTEVT1 based on Event 3 Trigger" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="EVT4TRIG" description="Sets OUTEVT1 based on Event 4 Trigger" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="EVT5TRIG" description="Sets OUTEVT1 based on Event 5 Trigger" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="EVT6TRIG" description="Sets OUTEVT1 based on Event 6 Trigger" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="EVT7TRIG" description="Sets OUTEVT1 based on Event 7 Trigger" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="EVT8TRIG" description="Sets OUTEVT1 based on Event 8 Trigger" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="SSS_OUTEVT2TRIGCFG" width="32" page="0" offset="0x194" instances="1" instaddr="4" internal="0" description="Output event2 configuration for triggers, link">
		<bitfield id="EVT1TRIG" description="Sets OUTEVT2 based on Event 1 Trigger" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="EVT2TRIG" description="Sets OUTEVT2 based on Event 2 Trigger" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="EVT3TRIG" description="Sets OUTEVT2 based on Event 3 Trigger" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="EVT4TRIG" description="Sets OUTEVT2 based on Event 4 Trigger" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="EVT5TRIG" description="Sets OUTEVT2 based on Event 5 Trigger" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="EVT6TRIG" description="Sets OUTEVT2 based on Event 6 Trigger" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="EVT7TRIG" description="Sets OUTEVT2 based on Event 7 Trigger" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="EVT8TRIG" description="Sets OUTEVT2 based on Event 8 Trigger" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="SSS_OUTEVT3TRIGCFG" width="32" page="0" offset="0x198" instances="1" instaddr="4" internal="0" description="Output event3 configuration for triggers, link">
		<bitfield id="EVT1TRIG" description="Sets OUTEVT3 based on Event 1 Trigger" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="EVT2TRIG" description="Sets OUTEVT3 based on Event 2 Trigger" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="EVT3TRIG" description="Sets OUTEVT3 based on Event 3 Trigger" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="EVT4TRIG" description="Sets OUTEVT3 based on Event 4 Trigger" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="EVT5TRIG" description="Sets OUTEVT3 based on Event 5 Trigger" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="EVT6TRIG" description="Sets OUTEVT3 based on Event 6 Trigger" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="EVT7TRIG" description="Sets OUTEVT3 based on Event 7 Trigger" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="EVT8TRIG" description="Sets OUTEVT3 based on Event 8 Trigger" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="SSS_OUTEVT4TRIGCFG" width="32" page="0" offset="0x19c" instances="1" instaddr="4" internal="0" description="Output event4 configuration for triggers, link">
		<bitfield id="EVT1TRIG" description="Sets OUTEVT4 based on Event 1 Trigger" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="EVT2TRIG" description="Sets OUTEVT4 based on Event 2 Trigger" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="EVT3TRIG" description="Sets OUTEVT4 based on Event 3 Trigger" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="EVT4TRIG" description="Sets OUTEVT4 based on Event 4 Trigger" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="EVT5TRIG" description="Sets OUTEVT4 based on Event 5 Trigger" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="EVT6TRIG" description="Sets OUTEVT4 based on Event 6 Trigger" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="EVT7TRIG" description="Sets OUTEVT4 based on Event 7 Trigger" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="EVT8TRIG" description="Sets OUTEVT4 based on Event 8 Trigger" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="SSS_OUTEVT1DUR" width="32" page="0" offset="0x1a0" instances="1" instaddr="4" internal="0" description="Output event1 configuration of delays">
		<bitfield id="TIME" description="Duration time for application of OUTEVT1" begin="23" end="0" width="24" rwaccess="RW"/>
	</register>
	<register id="SSS_OUTEVT2DUR" width="32" page="0" offset="0x1a4" instances="1" instaddr="4" internal="0" description="Output event2 configuration of delays">
		<bitfield id="TIME" description="Duration time for application of OUTEVT2" begin="23" end="0" width="24" rwaccess="RW"/>
	</register>
	<register id="SSS_OUTEVT3DUR" width="32" page="0" offset="0x1a8" instances="1" instaddr="4" internal="0" description="Output event3 configuration of delays">
		<bitfield id="TIME" description="Duration time for application of OUTEVT3" begin="23" end="0" width="24" rwaccess="RW"/>
	</register>
	<register id="SSS_OUTEVT4DUR" width="32" page="0" offset="0x1ac" instances="1" instaddr="4" internal="0" description="Output event4 configuration of delays">
		<bitfield id="TIME" description="Duration time for application of OUTEVT4" begin="23" end="0" width="24" rwaccess="RW"/>
	</register>
