ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_wadi_oper_sss_regs.xml
	<register id="SSS_EVT5CFG" width="32" page="0" offset="0x200" instances="1" instaddr="4" internal="0" description="Event5 that compares to trigger word SSS_EVTTRIG">
		<bitfield id="EVT5" description="Fifth word compare value configuration" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="EVT5_BLK5_TO_16" description="Fifth word compare value configuration" begin="31" end="8" width="24" rwaccess="RW"/>
	</register>
	<register id="SSS_EVT6CFG" width="32" page="0" offset="0x204" instances="1" instaddr="4" internal="0" description="Event6 that compares to trigger word SSS_EVTTRIG">
		<bitfield id="EVT6" description="Sixth word compare value configuration" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="EVT6_BLK5_TO_16" description="Sixth word compare value configuration" begin="31" end="8" width="24" rwaccess="RW"/>
	</register>
	<register id="SSS_EVT7CFG" width="32" page="0" offset="0x208" instances="1" instaddr="4" internal="0" description="Event7 that compares to trigger word SSS_EVTTRIG">
		<bitfield id="EVT7" description="Seventh word compare value configuration" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="EVT7_BLK5_TO_16" description="Seventh word compare value configuration" begin="31" end="8" width="24" rwaccess="RW"/>
	</register>
	<register id="SSS_EVT8CFG" width="32" page="0" offset="0x20c" instances="1" instaddr="4" internal="0" description="Event8 that compares to trigger word SSS_EVTTRIG">
		<bitfield id="EVT8" description="Eighth word compare value configuration" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="EVT8_BLK5_TO_16" description="Eighth word compare value configuration" begin="31" end="8" width="24" rwaccess="RW"/>
	</register>
	<register id="SSS_TRIGEVT5_8CFG" width="32" page="0" offset="0x210" instances="1" instaddr="4" internal="0" description="Configuration for using trigger word in specific manner">
		<bitfield id="TRIG_EVT5CFG" description="Selects action associated with event 5" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="TRIG_EVT6CFG" description="Selects action associated with event 6" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="TRIG_EVT7CFG" description="Selects action associated with event 7" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="TRIG_EVT8CFG" description="Selects action associated with event 8" begin="27" end="24" width="4" rwaccess="RW"/>
	</register>
	<register id="SSS_BLKSOUTEVT5CFG" width="32" page="0" offset="0x280" instances="1" instaddr="4" internal="0" description="Output event5 to be applied for output ">
		<bitfield id="OUTEVT5" description="Output configuration on event 5" begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
	<register id="SSS_BLKSOUTEVT6CFG" width="32" page="0" offset="0x284" instances="1" instaddr="4" internal="0" description="Output event6 to be applied for output ">
		<bitfield id="OUTEVT6" description="Output configuration on event 6" begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
	<register id="SSS_BLKSOUTEVT7CFG" width="32" page="0" offset="0x288" instances="1" instaddr="4" internal="0" description="Output event7 to be applied for output ">
		<bitfield id="OUTEVT7" description="Output configuration on event 7" begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
	<register id="SSS_BLKSOUTEVT8CFG" width="32" page="0" offset="0x28c" instances="1" instaddr="4" internal="0" description="Output event8 to be applied for output ">
		<bitfield id="OUTEVT8" description="Output configuration on event 8" begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
	<register id="SSS_OUTEVT5TRIGCFG" width="32" page="0" offset="0x290" instances="1" instaddr="4" internal="0" description="Output event5 configuration for triggers, link">
		<bitfield id="EVT1TRIG" description="Sets OUTEVT5 based on Event 1 Trigger" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="EVT2TRIG" description="Sets OUTEVT5 based on Event 2 Trigger" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="EVT3TRIG" description="Sets OUTEVT5 based on Event 3 Trigger" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="EVT4TRIG" description="Sets OUTEVT5 based on Event 4 Trigger" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="EVT5TRIG" description="Sets OUTEVT5 based on Event 5 Trigger" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="EVT6TRIG" description="Sets OUTEVT5 based on Event 6 Trigger" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="EVT7TRIG" description="Sets OUTEVT5 based on Event 7 Trigger" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="EVT8TRIG" description="Sets OUTEVT5 based on Event 8 Trigger" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="SSS_OUTEVT6TRIGCFG" width="32" page="0" offset="0x294" instances="1" instaddr="4" internal="0" description="Output event6 configuration for triggers, link">
		<bitfield id="EVT1TRIG" description="Sets OUTEVT6 based on Event 1 Trigger" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="EVT2TRIG" description="Sets OUTEVT6 based on Event 2 Trigger" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="EVT3TRIG" description="Sets OUTEVT6 based on Event 3 Trigger" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="EVT4TRIG" description="Sets OUTEVT6 based on Event 4 Trigger" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="EVT5TRIG" description="Sets OUTEVT6 based on Event 5 Trigger" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="EVT6TRIG" description="Sets OUTEVT6 based on Event 6 Trigger" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="EVT7TRIG" description="Sets OUTEVT6 based on Event 7 Trigger" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="EVT8TRIG" description="Sets OUTEVT6 based on Event 8 Trigger" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="SSS_OUTEVT7TRIGCFG" width="32" page="0" offset="0x298" instances="1" instaddr="4" internal="0" description="Output event7 configuration for triggers, link">
		<bitfield id="EVT1TRIG" description="Sets OUTEVT7 based on Event 1 Trigger" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="EVT2TRIG" description="Sets OUTEVT7 based on Event 2 Trigger" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="EVT3TRIG" description="Sets OUTEVT7 based on Event 3 Trigger" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="EVT4TRIG" description="Sets OUTEVT7 based on Event 4 Trigger" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="EVT5TRIG" description="Sets OUTEVT7 based on Event 5 Trigger" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="EVT6TRIG" description="Sets OUTEVT7 based on Event 6 Trigger" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="EVT7TRIG" description="Sets OUTEVT7 based on Event 7 Trigger" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="EVT8TRIG" description="Sets OUTEVT7 based on Event 8 Trigger" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="SSS_OUTEVT8TRIGCFG" width="32" page="0" offset="0x29c" instances="1" instaddr="4" internal="0" description="Output event8 configuration for triggers, link">
		<bitfield id="EVT1TRIG" description="Sets OUTEVT8 based on Event 1 Trigger" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="EVT2TRIG" description="Sets OUTEVT8 based on Event 2 Trigger" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="EVT3TRIG" description="Sets OUTEVT8 based on Event 3 Trigger" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="EVT4TRIG" description="Sets OUTEVT8 based on Event 4 Trigger" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="EVT5TRIG" description="Sets OUTEVT8 based on Event 5 Trigger" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="EVT6TRIG" description="Sets OUTEVT8 based on Event 6 Trigger" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="EVT7TRIG" description="Sets OUTEVT8 based on Event 7 Trigger" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="EVT8TRIG" description="Sets OUTEVT8 based on Event 8 Trigger" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="SSS_OUTEVT5DUR" width="32" page="0" offset="0x2a0" instances="1" instaddr="4" internal="0" description="Output event5 configuration of delays">
		<bitfield id="TIME" description="Duration time for application of OUTEVT5" begin="23" end="0" width="24" rwaccess="RW"/>
	</register>
	<register id="SSS_OUTEVT6DUR" width="32" page="0" offset="0x2a4" instances="1" instaddr="4" internal="0" description="Output event6 configuration of delays">
		<bitfield id="TIME" description="Duration time for application of OUTEVT6" begin="23" end="0" width="24" rwaccess="RW"/>
	</register>
	<register id="SSS_OUTEVT7DUR" width="32" page="0" offset="0x2a8" instances="1" instaddr="4" internal="0" description="Output event7 configuration of delays">
		<bitfield id="TIME" description="Duration time for application of OUTEVT7" begin="23" end="0" width="24" rwaccess="RW"/>
	</register>
	<register id="SSS_OUTEVT8DUR" width="32" page="0" offset="0x2ac" instances="1" instaddr="4" internal="0" description="Output event8 configuration of delays">
		<bitfield id="TIME" description="Duration time for application of OUTEVT8" begin="23" end="0" width="24" rwaccess="RW"/>
	</register>
	<register id="PARTEST" width="32" page="0" offset="0x2c8" instances="1" instaddr="4" internal="0" description="Enables parity test">
		<bitfield id="TESTEN" description="Parity test enable configuration" begin="3" end="0" width="4" rwaccess="RW"/>
	</register>
</module>
